#include <iostream> // Підключення бібліотеки для вводу-виводу

int main() {
    int a, b, c, d; // Оголошення змінних a, b, c, d
    std::cout << "Enter values for a, b, c, and d: \n"; // Запит на введення значень
    std::cin >> a >> b >> c >> d; // Введення значень з клавіатури

    // Обчислення результату з використанням побітових операцій і арифметичних операцій
    int result =
        (b << 10) + // Зсув b на 10 бітів вліво (еквівалент множенню на 1024)
        ((d << 4) - d + // Зсув d на 4 біти вліво (еквівалент множенню на 16) і віднімання d (еквівалент 15*d)
            ((a << 3) + (a << 2))) / 512 - // Зсув a на 3 біти вліво (еквівалент множенню на 8) плюс зсув a на 2 біти вліво (еквівалент множенню на 4) (еквівалент 12*a) і ділення на 512
        (c << 12) + // Зсув c на 12 бітів вліво (еквівалент множенню на 4096)
        c + // Додавання c
        (d << 3) + (d << 2) + d; // Зсув d на 3 біти вліво (еквівалент множенню на 8), додавання зсуву d на 2 біти вліво (еквівалент множенню на 4), плюс d (еквівалент 13*d)

    std::cout << "Result: " << result << std::endl; // Виведення результату

    return 0; // Завершення програми
}
//Перше завдання